tools/аудиты/фикстуры/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

tools/аудиты/фикстуры/Documents/УЗ_ПриходДенег/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Фикстура аудитов: модуль формы без модальных окон и без БСП.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;
	// реквизит формы «Пользователи» — таблица значений, а не общий модуль БСП
	Пользователи.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПослеВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Заполнить расшифровку?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.Расшифровка.Очистить();
	НоваяСтрока = Объект.Расшифровка.Добавить();
	НоваяСтрока.Назначение = "Оплата занятий";
	НоваяСтрока.СуммаСтроки = Объект.Сумма;

КонецПроцедуры
